tonyrog/candyspeak/port/csp_stm32.c
// CandySpeak on STM32F4, on the registers.
//
// The same job csp_lpcopen.c does for NXP, with one deliberate difference:
// there is no vendor HAL under this. cmsis-device-f4 supplies the register map
// (stm32f405xx.h) and ARM's CMSIS-Core supplies NVIC/SysTick/SCB, and
// everything between those and CandySpeak is here. ST's HAL would be a third
// layer with its own handle structs and its own init-time allocation, for six
// peripherals we drive directly in a few hundred lines.
//
// PORTS AND PINS. `#digital Led out 2:0` is GPIOC pin 0 -- port 0 is GPIOA and
// they run in order, exactly as the part numbers them. An #analog needs a
// peripheral rather than a GPIO and is selected by PORT:
//
//   #analog Batt:12 in 15:9        port 15 = ADC1, pin = channel  -> ADC1_IN9
//   #analog Out:12 out 13:0        port 13 = DAC channel 1
//   #analog M1:15 out pwm 0:1      `pwm` on a GPIO port -> the board's PWM map
//
// THE BOARD HEADER IS WHERE THE WIRING LIVES. csp_board.h is generated from
// boards/<name>.terms and carries three things this file cannot know: which
// alternate function each pin needs (CSP_BOARD_PINS), which timer channel a PWM
// pin is (CSP_BOARD_PWM), and which peripheral clocks to enable
// (CSP_STM_RCC_*). See gen_chips.erl.

// stdint FIRST: csp_config.h types the reactive gate mask (uint16_t) and there
// is no core header here to have pulled it in already.
#include <stdint.h>
#include <stddef.h>

#include "csp_config.h"

// Bounds the idle sleep, so continuous inputs keep sampling even when a slow
// timer is armed. See the end of csp_loop.
#ifndef SAMPLE_MS
#define SAMPLE_MS 2
#endif

#include "stm32f405xx.h"

#include <stdlib.h>
#include <string.h>

#define CSP_EMBEDDED 1
#include "csp.h"
#include "csp_print.h"
#include "csp_strings.h"

#if defined(CSP_EXEC_ONLY)
#define CSP_CSTATE NULL
#else
#include "csp_compile.h"
#define CSP_CSTATE csp_cstate()
#endif

// Clocks, computed by sysinit_f405.c from the board's crystal. Read rather than
// recomputed: two places deriving the same frequency is two places to get it
// wrong, and the one that boots is the one that is right.
extern const uint32_t csp_stm_hclk;
extern const uint32_t csp_stm_pclk1;
extern const uint32_t csp_stm_pclk2;
extern const uint32_t csp_stm_tim1;   // timers on APB1, doubler applied
extern const uint32_t csp_stm_tim2;   // timers on APB2

// --- board knobs ------------------------------------------------------------
#ifndef CSP_STM_ADC_PORT
#define CSP_STM_ADC_PORT  15         // an #analog here reads an ADC channel
#endif
#ifndef CSP_STM_DAC_PORT
#define CSP_STM_DAC_PORT  13         // ...and here it writes the DAC
#endif
#ifndef CSP_STM_ADC_BITS
#define CSP_STM_ADC_BITS  12
#endif
#ifndef CSP_STM_BAUD
#define CSP_STM_BAUD      115200
#endif
#ifndef CSP_STM_PWM_HZ
// 328 Hz is what a brushed-motor drone wants and 50 Hz is what a servo wants.
// Neither is a safe default for the other, so this is the middle that damages
// nothing and every board that cares states its own.
#define CSP_STM_PWM_HZ    1000
#endif

// The GPIO blocks, in port order. A port number from a declaration indexes this
// directly -- `2:0` is entry 2, GPIOC.
static GPIO_TypeDef* const gpio_port[] = {
    GPIOA, GPIOB, GPIOC, GPIOD, GPIOE, GPIOF, GPIOG, GPIOH, GPIOI
};
#define NPORTS ((int)(sizeof(gpio_port)/sizeof(gpio_port[0])))

// Pin modes, as the board header spells them.
#define CSP_MODE_IN      0
#define CSP_MODE_OUT     1
#define CSP_MODE_AF      2
#define CSP_MODE_ANALOG  3

typedef struct {
    uint8_t port, pin, mode, af;
} csp_stm_pin_t;

typedef struct {
    uint8_t port, pin, tim, ch;      // tim: 1..14, ch: 1..4
} csp_stm_pwm_t;

#if defined(CSP_BOARD_PINS)
static const csp_stm_pin_t board_pins[] = { CSP_BOARD_PINS };
#endif
#if defined(CSP_BOARD_PWM)
static const csp_stm_pwm_t board_pwm[] = { CSP_BOARD_PWM };
#endif

// ============================================================
// GPIO
// ============================================================

// Two bits per pin in MODER and PUPDR, one in OTYPER and ODR, four in AFR.
// Written read-modify-write, so configuring one pin does not disturb its
// fifteen neighbours -- which a whole-register write would, and silently.
static void stm_pin_mode(uint8_t port, uint8_t pin, uint8_t mode, uint8_t af)
{
    GPIO_TypeDef* g;

    if (port >= NPORTS || pin > 15)
	return;
    g = gpio_port[port];

    if (mode == CSP_MODE_AF) {
	// AFR is two 32-bit words of eight 4-bit fields. Pin 8 and up is the
	// high word, and the shift is within that word -- not within 32 pins.
	volatile uint32_t* afr = &g->AFR[pin >> 3];
	*afr = (*afr & ~(0xFu << ((pin & 7u) * 4u))) |
	       ((uint32_t)af << ((pin & 7u) * 4u));
    }
    g->MODER = (g->MODER & ~(3u << (pin * 2u))) | ((uint32_t)mode << (pin * 2u));
}

static void stm_pin_pull(uint8_t port, uint8_t pin, int up, int down)
{
    GPIO_TypeDef* g;
    uint32_t v;

    if (port >= NPORTS || pin > 15)
	return;
    g = gpio_port[port];
    v = up ? 1u : (down ? 2u : 0u);
    g->PUPDR = (g->PUPDR & ~(3u << (pin * 2u))) | (v << (pin * 2u));
}

// BSRR, not ODR. A read-modify-write of ODR loses a concurrent write to another
// pin of the same port from an interrupt; BSRR sets and clears atomically, one
// bit each, which is what the register exists for.
static void stm_pin_write(uint8_t port, uint8_t pin, int on)
{
    if (port >= NPORTS || pin > 15)
	return;
    gpio_port[port]->BSRR = on ? (1u << pin) : (1u << (pin + 16u));
}

static int stm_pin_read(uint8_t port, uint8_t pin)
{
    if (port >= NPORTS || pin > 15)
	return 0;
    return (gpio_port[port]->IDR & (1u << pin)) ? 1 : 0;
}

void csp_board_digital_input(csp_rt_t* st, index_t ix, value_t* vptr)
{
    uint8_t port = value_get_d_port(vptr);
    uint8_t pin = value_get_d_pin(vptr);    
    csp_set_ivalue(st, ix, stm_pin_read(port, pin));
}

// An inout pin is borrowed for the length of one write and handed straight back
// as an input, which is what makes a bidirectional line usable from a rule.
void csp_board_digital_output(csp_rt_t* st, value_t* vptr)
{
    (void)st;
    uint8_t port = value_get_d_port(vptr);
    uint8_t pin = value_get_d_pin(vptr);
    uint8_t dir = value_get_d_dir(vptr);
    if (dir & DIR_IN) {
	stm_pin_mode(port, pin, CSP_MODE_OUT, 0);
	stm_pin_write(port, pin, value_get_d_val(vptr));
	stm_pin_mode(port, pin, CSP_MODE_IN, 0);
    }
    else {
	stm_pin_write(port, pin, value_get_d_val(vptr));
    }
}

