tonyrog/candyspeak/port/csp_stm32.c
// The single description of what a digital slot's configuration MEANS in
// hardware, so setup and a rule that writes .dir cannot drift apart.
//
// PULLUPS ARE HERE, unlike the LPC port. On STM32 they are in the GPIO block
// (PUPDR) rather than in a separate pin-control peripheral, so there is no
// reason to make the board deal with them.
void csp_board_digital_config(value_t* vptr)
{
    uint8_t port = value_get_d_port(vptr);
    uint8_t pin = value_get_d_pin(vptr);
    uint8_t dir = value_get_d_dir(vptr);    
    if (dir & DIR_IN) {
	stm_pin_mode(port, pin, CSP_MODE_IN, 0);
	stm_pin_pull(port, pin,
		     value_get_d_pullup(vptr), value_get_d_pulldown(vptr));
    }
    else if (dir & DIR_OUT) {
	stm_pin_mode(port, pin, CSP_MODE_OUT, 0);
    }
}

// ============================================================
// The tick
// ============================================================

static volatile uint32_t csp_ticks_ms = 0;
static uint32_t tick_reload;

void SysTick_Handler(void)
{
    csp_ticks_ms++;
}

void csp_tick_isr(void) { csp_ticks_ms++; }

static void stm_tick_init(void)
{
    tick_reload = csp_stm_hclk / 1000u;
    SysTick_Config(tick_reload);
}

uint32_t csp_time_ms(void)
{
    return csp_ticks_ms;
}

// Microseconds, composed from the ms counter and the fraction of the current
// period SysTick has left. VAL counts DOWN from LOAD, so elapsed-within-the-
// period is LOAD - VAL.
//
// Read ms twice around the counter and retry if it moved: the counter wraps
// exactly when ms increments, so a naive pair can report a time a whole
// millisecond early.
unsigned long csp_time_us(void)
{
    uint32_t ms, val, ms2;

    do {
	ms  = csp_ticks_ms;
	val = tick_reload - SysTick->VAL;
	ms2 = csp_ticks_ms;
    } while (ms != ms2);
    return (unsigned long)(ms * 1000UL +
			   ((val * 1000UL) / (tick_reload ? tick_reload : 1)));
}

static void csp_delay_ms(uint32_t ms)
{
    uint32_t t0 = csp_ticks_ms;
    while ((csp_ticks_ms - t0) < ms)
	__WFI();
}

// ============================================================
// Console UART
// ============================================================

#ifndef CSP_STM_UART
#define CSP_STM_UART USART2
#endif

static int serial_output = 0;

// Which APB the console sits on, because the baud divisor is computed from that
// bus and USART1/6 are on APB2 while the rest are on APB1. Getting it wrong
// gives a port that transmits at half or double the rate -- garbage that looks
// like a wiring fault.
static uint32_t stm_uart_clk(void)
{
    if ((CSP_STM_UART == USART1) || (CSP_STM_UART == USART6))
	return csp_stm_pclk2;
    return csp_stm_pclk1;
}

static void stm_uart_init(void)
{
    uint32_t clk = stm_uart_clk();

    // OVER8 = 0, so the divisor is clk/baud in 12.4 fixed point. Rounded rather
    // than truncated: at 168/4 MHz and 115200 the truncation alone is a 0.6%
    // error, and the receiver's budget for everything is about 2%.
    CSP_STM_UART->BRR = (uint16_t)((clk + (CSP_STM_BAUD / 2u)) / CSP_STM_BAUD);
    CSP_STM_UART->CR1 = USART_CR1_UE | USART_CR1_TE | USART_CR1_RE;  // 8N1
    CSP_STM_UART->CR2 = 0;
    CSP_STM_UART->CR3 = 0;
}

static int stm_uart_can_send(void)
{
    return (CSP_STM_UART->SR & USART_SR_TXE) != 0;
}

static int stm_uart_available(void)
{
    return (CSP_STM_UART->SR & USART_SR_RXNE) != 0;
}

static int stm_uart_read(void)
{
    return (int)(CSP_STM_UART->DR & 0xFF);
}

void* csp_set_file_output(void* f)
{
    int prev = serial_output;
    serial_output = (f != NULL);
    return prev ? (void*)1 : (void*)0;
}

int csp_will_output(void)
{
    return serial_output;
}

// The CR belongs here and nowhere else: the runtime ends a line three different
// ways and all three come through csp_print_char.
int csp_print_char(char c)
{
    // The console tap. First thing, and NON-CONSUMING: the port still prints,
    // because a node with a terminal attached wants to see its own output. At
    // CSP_CONSOLE_BYTES == 0 this compiles to nothing.
    csp_repl_tap(c);
    if (!serial_output)
	return 0;
    if (c == '\n') {
	while (!stm_uart_can_send())
	    ;
	CSP_STM_UART->DR = '\r';
    }
    while (!stm_uart_can_send())
	;
    CSP_STM_UART->DR = (uint8_t)c;
    return 1;
}

int csp_print_str(const char* s)
{
    int n = 0;
    while (*s)
	n += csp_print_char(*s++);
    return n;
}

int csp_print_rostr(rostring_t s)
{
    return csp_print_str((const char*) s);
}

void csp_flush(void)
{
    // Nothing is buffered here -- csp_print_char blocks until the shift
    // register takes the byte -- so this is where the LAST byte is waited for
    // rather than where a buffer is drained. Without it a reset immediately
    // after a print truncates the line.
    while (!(CSP_STM_UART->SR & USART_SR_TC))
	;
}

// ============================================================
// ADC
// ============================================================

static void stm_adc_init(void)
{
    // ADCCLK = PCLK2 / 8. The converter tops out at 36 MHz and PCLK2 is 84, so
    // /4 would be over and /8 is the first legal divisor. Sampling is slower
    // than it has to be by a factor of two; nothing here samples fast enough
    // to notice, and being over the limit is a converter that reads noise.
    ADC->CCR = (ADC->CCR & ~ADC_CCR_ADCPRE) | ADC_CCR_ADCPRE;   // /8
    ADC1->CR1 = 0;                        // 12-bit, no scan, no interrupts
    ADC1->CR2 = ADC_CR2_ADON;
    ADC1->SQR1 = 0;                       // one conversion in the sequence
}

// 480 cycles on every channel. The longest the part offers, chosen because the
// source impedance of whatever a board wires up is unknown -- a short sample
// time on a high-impedance source reads the previous channel, faintly.
static void stm_adc_sample_time(uint8_t ch)
{
    if (ch <= 9)
	ADC1->SMPR2 = (ADC1->SMPR2 & ~(7u << (ch * 3u))) | (7u << (ch * 3u));
    else
	ADC1->SMPR1 = (ADC1->SMPR1 & ~(7u << ((ch - 10u) * 3u))) |
		      (7u << ((ch - 10u) * 3u));
}

static int stm_adc_read(uint8_t ch)
{
    if (ch > 18)
	return 0;
    stm_adc_sample_time(ch);
    ADC1->SQR3 = ch;                      // the one conversion
    ADC1->CR2 |= ADC_CR2_SWSTART;
    while (!(ADC1->SR & ADC_SR_EOC))
	;
    return (int)(ADC1->DR & 0xFFF);
}

// Scale a raw converter reading into the declared width and sign, exactly as
// the LPC port does -- so `#analog X:8 in` means the same thing on both.
static int stm_scale(csp_rt_t* st, index_t ix, int raw)
{
    csp_decl_t d;
    int res, sgn;
    int v;

    // Clamped the same way the LPC port clamps it: a width outside 2..16 is a
    // shift by more than the type has bits, which is undefined rather than
    // merely wrong.
    csp_load_decl(st, INDEX(ix), &d);
    res = GET_RES(csp_decl_get_res(&d));
    sgn = (CSP_MASK(csp_decl_get_vt(&d),TYPE_BITS) != V_UNSIGNED);
    
    if (res < 2) res = 2; else if (res > 16) res = 16;
    if (res >= CSP_STM_ADC_BITS)
	v = raw << (res - CSP_STM_ADC_BITS);
    else
	v = raw >> (CSP_STM_ADC_BITS - res);
    if (sgn)
	v -= (1 << (res - 1));                // 0 = mid scale
    return v;
}

void csp_board_analog_input(csp_rt_t* st, index_t ix, value_t* vptr)
{
    int value = 0;
    uint8_t port = value_get_a_port(vptr);
    uint8_t pin = value_get_a_pin(vptr);    
    if (port == CSP_STM_ADC_PORT)
	value = stm_scale(st, ix, stm_adc_read(pin));
    csp_set_ivalue(st, ix, value);
}

