tonyrog/candyspeak/port/csp_stm32.c
// ============================================================
// PWM
// ============================================================

#if defined(CSP_BOARD_PWM)
static TIM_TypeDef* const tim_of[] = {
    NULL, TIM1, TIM2, TIM3, TIM4, TIM5, TIM6, TIM7,
    TIM8, TIM9, TIM10, TIM11, TIM12, TIM13, TIM14
};
#define NTIM ((int)(sizeof(tim_of)/sizeof(tim_of[0])))

// TIM1 and TIM8..11 are on APB2; the rest on APB1. Both buses feed their timers
// at twice the bus clock when the bus is divided -- the "timer clock doubler" --
// which sysinit has already worked out.
static uint32_t tim_clk(uint8_t t)
{
    return ((t == 1) || ((t >= 8) && (t <= 11))) ? csp_stm_tim2 : csp_stm_tim1;
}

static const csp_stm_pwm_t* pwm_of(uint8_t port, uint8_t pin)
{
    unsigned i;
    for (i = 0; i < sizeof(board_pwm)/sizeof(board_pwm[0]); i++)
	if ((board_pwm[i].port == port) && (board_pwm[i].pin == pin))
	    return &board_pwm[i];
    return NULL;
}
#endif  // CSP_BOARD_PWM

// PWM resolution. The period is ARR+1 counts, and the duty this port is handed
// is 0..255 -- so ARR is set to make one count of duty land on a whole number
// of timer counts, which is what keeps the low end from quantising to nothing.
#define PWM_STEPS 255u

static void stm_pwm_init(void)
{
#if defined(CSP_BOARD_PWM)
    unsigned i;
    uint8_t done[NTIM];

    for (i = 0; i < (unsigned)NTIM; i++)
	done[i] = 0;

    for (i = 0; i < sizeof(board_pwm)/sizeof(board_pwm[0]); i++) {
	const csp_stm_pwm_t* p = &board_pwm[i];
	TIM_TypeDef* t;
	uint32_t psc;

	if ((p->tim == 0) || (p->tim >= NTIM))
	    continue;
	t = tim_of[p->tim];

	if (!done[p->tim]) {
	    // period = (PSC+1) * (ARR+1) / clk. ARR is fixed at the duty
	    // resolution and the prescaler absorbs the rest, so every channel
	    // of every timer takes the same 0..255 and means the same thing.
	    psc = tim_clk(p->tim) / (CSP_STM_PWM_HZ * (PWM_STEPS + 1u));
	    t->PSC = (psc > 0) ? (psc - 1u) : 0u;
	    t->ARR = PWM_STEPS;
	    t->CR1 = TIM_CR1_ARPE;
	    done[p->tim] = 1;
	}

	// PWM mode 1 with preload, so a duty written mid-period takes effect at
	// the next update rather than producing one short or long pulse.
	switch (p->ch) {
	case 1:
	    t->CCMR1 = (t->CCMR1 & ~0xFFu) | (6u << 4) | TIM_CCMR1_OC1PE;
	    t->CCER |= TIM_CCER_CC1E;
	    break;
	case 2:
	    t->CCMR1 = (t->CCMR1 & ~0xFF00u) | (6u << 12) | TIM_CCMR1_OC2PE;
	    t->CCER |= TIM_CCER_CC2E;
	    break;
	case 3:
	    t->CCMR2 = (t->CCMR2 & ~0xFFu) | (6u << 4) | TIM_CCMR2_OC3PE;
	    t->CCER |= TIM_CCER_CC3E;
	    break;
	case 4:
	    t->CCMR2 = (t->CCMR2 & ~0xFF00u) | (6u << 12) | TIM_CCMR2_OC4PE;
	    t->CCER |= TIM_CCER_CC4E;
	    break;
	default:
	    break;
	}
	// TIM1 and TIM8 are the advanced timers and their outputs stay
	// disconnected until MOE is set. Nothing else needs this, and a board
	// that puts a motor on TIM1 without it sees a timer counting happily
	// and a pin that never moves.
	if ((p->tim == 1) || (p->tim == 8))
	    t->BDTR |= TIM_BDTR_MOE;
	t->EGR = TIM_EGR_UG;              // load PSC/ARR now
	t->CR1 |= TIM_CR1_CEN;
    }
#endif
}

static void stm_pwm_write(uint8_t port, uint8_t pin, int val)
{
#if defined(CSP_BOARD_PWM)
    const csp_stm_pwm_t* p = pwm_of(port, pin);
    TIM_TypeDef* t;

    if (p == NULL)
	return;
    t = tim_of[p->tim];
    if (val < 0) val = 0;
    if (val > (int)PWM_STEPS) val = (int)PWM_STEPS;

    switch (p->ch) {
    case 1: t->CCR1 = (uint32_t)val; break;
    case 2: t->CCR2 = (uint32_t)val; break;
    case 3: t->CCR3 = (uint32_t)val; break;
    case 4: t->CCR4 = (uint32_t)val; break;
    default: break;
    }
#else
    (void)port; (void)pin; (void)val;
#endif
}

static void stm_dac_write(uint8_t ch, int val)
{
    if (ch == 0)
	DAC->DHR12R1 = (uint32_t)val & 0xFFF;
    else
	DAC->DHR12R2 = (uint32_t)val & 0xFFF;
}

void csp_board_analog_output(csp_rt_t* st, int di, value_t* vptr)
{
    uint8_t port = value_get_a_port(vptr);
    uint8_t pin = value_get_a_pin(vptr);
    uint16_t aval = value_get_a_val(vptr);
    if (port == CSP_STM_DAC_PORT) {
	stm_dac_write(pin, aval);
	return;
    }
    if (value_get_a_pwm(vptr)) {
	// Scale the declared width down to the 0..255 the hook takes, so a
	// `:16` and a `:8` output differ in precision and not in meaning.
	int full = (1 << GET_RES(decl(st,di,res))) - 1;
	int val  = full ? (int)((aval * (int)PWM_STEPS) / full) : 0;
	stm_pwm_write(port, pin, val);
    }
}

void csp_board_analog_config(value_t* vptr)
{
    uint8_t port = value_get_a_port(vptr);
    uint8_t pin = value_get_a_pin(vptr);    
    // An ADC pin needs analog mode -- and on STM32 that is a real mode, not a
    // flag: leaving it digital puts the input buffer across the source and the
    // reading sags. A PWM pin was already put in AF mode by the board pin
    // table, so there is nothing to assert here.
    if ((value_get_a_dir(vptr) & DIR_IN) && (port != CSP_STM_ADC_PORT))
	stm_pin_mode(port, pin, CSP_MODE_ANALOG, 0);
}

// ============================================================
// Board lifecycle
// ============================================================

static void stm_clocks_on(void)
{
    // Every peripheral this board uses, written WHOLE from the board header --
    // so a peripheral not in {enable,...} stays off rather than being left at
    // whatever a warm reset had. The same argument as PCONP on an LPC.
#if defined(CSP_STM_RCC_AHB1)
    RCC->AHB1ENR = CSP_STM_RCC_AHB1;
#endif
#if defined(CSP_STM_RCC_APB1)
    RCC->APB1ENR |= CSP_STM_RCC_APB1;
#endif
#if defined(CSP_STM_RCC_APB2)
    RCC->APB2ENR = CSP_STM_RCC_APB2;
#endif
    // The writes are posted on this bus: a peripheral touched in the next
    // instruction can be touched before its clock has actually arrived. Reading
    // one back orders it.
    (void)RCC->AHB1ENR;
}

static void stm_board_pins(void)
{
#if defined(CSP_BOARD_PINS)
    unsigned i;
    for (i = 0; i < sizeof(board_pins)/sizeof(board_pins[0]); i++) {
	const csp_stm_pin_t* p = &board_pins[i];
	// Output speed HIGH on every muxed pin. The reset default is 2 MHz,
	// which rounds a 328 Hz PWM edge into something a motor driver reads as
	// noise -- and the cost of high speed on a pin that does not need it is
	// a few mA of edge current.
	if (p->port < NPORTS && p->pin <= 15)
	    gpio_port[p->port]->OSPEEDR |= (3u << (p->pin * 2u));
	stm_pin_mode(p->port, p->pin, p->mode, p->af);
    }
#endif
}

