tonyrog/candyspeak/port/csp_stm32.c
void csp_board_init(void)
{
    stm_clocks_on();
    stm_board_pins();
    stm_adc_init();
    stm_pwm_init();
}

void csp_board_setup(csp_rt_t* st)        { (void)st; }
void csp_board_start_input(csp_rt_t* st)  { (void)st; }
void csp_board_start_output(csp_rt_t* st) { (void)st; }
void csp_board_stop_output(csp_rt_t* st)  { (void)st; }

// ============================================================
// Memory
// ============================================================

extern char _heap_start, _stack_top;

// Declared HERE rather than with the loops below, because the memory report
// needs its mem_limit and C wants the object before the use.
static csp_rt_t state;

// The gap between the current stack frame and the bottom of the heap. Measured
// the same way csp_lpcopen.c measures it -- from a local's address -- and NOT
// through sbrk: newlib's sbrk needs a _sbrk this port does not supply, and
// supplying one would hand out memory the arena has already claimed.
static uint32_t raw_free(void)
{
    char top;
    return (uint32_t)(&top - &_heap_start);
}

uint32_t csp_system_ram_capacity(void)
{
#if defined(CSP_STM_RAM)
    return CSP_STM_RAM;
#else
    return (uint32_t)(&_stack_top - &_heap_start);
#endif
}

uint32_t csp_system_ram_avail(void)
{
    return raw_free();
}

// What CandySpeak is NOT responsible for: total used, minus the arena and the
// runtime struct. Reported separately so /memory can say whether a shortage is
// the program's doing or the platform's.
uint32_t csp_system_ram_used(void)
{
    uint32_t cap = csp_system_ram_capacity();
    uint32_t total, ours;

    if (cap == 0)
	return 0;
    total = cap - raw_free();
    ours  = (uint32_t)state.mem_limit + (uint32_t)sizeof(csp_rt_t);
    return (total > ours) ? (total - ours) : 0;
}

// ============================================================
// The device loops -- identical in shape to csp_lpcopen.c
// ============================================================

static int first_cycle = 1;

// Apply a configuration a rule asked for, and take the request down in BOTH
// slots -- the pair is copied on commit, so clearing one leaves a stale request
// in the other that spends a config call on some later cycle.
//
// THIS IS THE THIRD COPY. csp_lpcopen.c says, above its own, that a third port
// is when this belongs in a shared csp_io.c -- and it is right. It is not done
// here because the three csp_setup loops are NOT identical: the LPC one calls
// csp_lpc_pin_mux per device where this one has already muxed everything from
// the board table, so factoring the loops out means moving that call into
// csp_board_digital_config on a port that cannot be tested from here. Worth
// doing; worth doing on its own, with the LPC board in reach.
static void csp_apply_config(csp_rt_t* st, index_t ix, value_t* vptr, int analog)
{
    value_t* iptr;
    value_t* optr;

    csp_dio_slots(st, ix, &iptr, &optr);
    if (analog) {
	csp_board_analog_config(vptr);
	value_set_a_cfg(iptr, 0);
	value_set_a_cfg(optr, 0);
    }
    else {
	csp_board_digital_config(vptr);
	value_set_d_cfg(iptr, 0);
	value_set_d_cfg(optr, 0);	
    }
}

void csp_setup(csp_rt_t* st)
{
    int i;

    csp_board_setup(st);
    csp_can_init(st);

    for (i = 0; i < st->nio; i++) {
	index_t ix = csp_io_at(st, i);
	int j = INDEX(ix);
	value_t* vptr = csp_dio_slot(st, ix, DOUT);
	switch (decl(st,j,type)) {
	case DECL_DIGITAL:
	    csp_board_digital_config(vptr);
	    break;
	case DECL_ANALOG:
	    csp_board_analog_config(vptr);
	    break;
	default:
	    break;
	}
    }
    csp_ctx_reset(st);
    // AFTER the pin loop: arming an interrupt on a pin still at its reset
    // default arms it on whatever the pin happened to be.
    csp_setup_events(st);
}

void csp_input(csp_rt_t* st)
{
    int i;

    csp_board_start_input(st);
    for (i = 0; i < st->nio; i++) {
	index_t ix = csp_io_at(st, i);
	int di = INDEX(ix);
	value_t* vptr;
	switch (decl(st,di,type)) {
	case DECL_DIGITAL:
	    vptr = csp_dio_slot(st, ix, DOUT);
	    if (value_get_d_cfg(vptr))
		csp_apply_config(st, ix, vptr, 0);
	    if (value_get_d_dir(vptr) & DIR_IN)
		csp_board_digital_input(st, ix, vptr);
	    break;
	case DECL_ANALOG:
	    vptr = csp_dio_slot(st, ix, DOUT);
	    if (value_get_a_cfg(vptr))
		csp_apply_config(st, ix, vptr, 1);
	    if (value_get_a_dir(vptr) & DIR_IN)
		csp_board_analog_input(st, ix, vptr);
	    break;
	default:
	    break;
	}
    }
    csp_ctx_reset(st);
    csp_can_input(st);
    csp_buf_input(st);   // i2c/spi collections and datagrams
    csp_input_timer(st);
    csp_input_event(st);   // deal out this cycle's interrupt edges
}

void csp_output(csp_rt_t* st)
{
    int i;

    if (!st->latch) {
	csp_board_start_output(st);
	for (i = 0; i < st->nio; ++i) {
	    index_t ix = csp_io_at(st, i);
	    int di = INDEX(ix);
	    value_t* vptr;
	    switch (decl(st,di,type)) {
	    case DECL_DIGITAL:
		vptr = csp_dio_slot(st, ix, DOUT);
		if (value_get_d_cfg(vptr))
		    csp_apply_config(st, ix, vptr, 0);
		if (value_get_d_dir(vptr) & DIR_OUT)
		    csp_board_digital_output(st, vptr);
		break;
	    case DECL_ANALOG:
		vptr = csp_dio_slot(st, ix, DOUT);
		if (value_get_a_cfg(vptr))
		    csp_apply_config(st, ix, vptr, 1);
		if (value_get_a_dir(vptr) & DIR_OUT)
		    csp_board_analog_output(st, di, vptr);
		break;
	    default:
		break;
	    }
	}
	csp_ctx_reset(st);
	csp_can_output(st);
	csp_buf_output(st);  // i2c/spi starts and datagrams
	csp_board_stop_output(st);
    }
    csp_output_timer(st);
}

// ============================================================
// CAN -- STUBS
// ============================================================
//
// The F405 has two bxCAN controllers and no board here wires one up yet. These
// are the same no-bus stubs csp_lpcopen.c compiles when a board names no
// {can,...}: init succeeds and recv always says "nothing", so a program with a
// #buffer runs and stays quiet rather than failing to link.
//
// A real backend is a filter bank, three transmit mailboxes and two receive
// FIFOs -- the shape can_212x.c has, in ST's spelling.

int csp_can_init(csp_rt_t* st) { (void)st; return 0; }

