tonyrog/candyspeak/port/csp_stm32.c
// By KIND, not by name: csp_region_find takes a name because that is what
// /upgrade's argument is, and the store is not something a person types. A
// board that spells its settings region something other than "store" still
// works, which a name lookup would not.
static const csp_region_t* store_region(void)
{
    const csp_device_t* d = csp_device();
    uint8_t i;

    for (i = 0; i < d->nregion; i++)
	if (d->region[i].kind == CSP_REG_STORE)
	    return &d->region[i];
    return NULL;
}

static uint32_t store_off;        // byte cursor within the region
static uint32_t store_base;       // the region's offset from the flash base
static uint32_t store_len;
static int      store_mode;       // 0 closed, 1 reading, 2 writing

const char* csp_eeprom_name(void)
{
    static const char nm[] = "FLASH store";
    return nm;
}

uint32_t csp_eeprom_capacity(void)
{
    const csp_region_t* r = store_region();
    return r ? csp_region_size(csp_device(), r) : 0;
}

int csp_eeprom_open_read(void)
{
    const csp_region_t* r = store_region();

    if (r == NULL)
	return -1;
    store_base = csp_region_offset(csp_device(), r);
    store_len  = csp_region_size(csp_device(), r);
    store_off  = 0;
    store_mode = 1;
    return 0;
}

int csp_eeprom_open_write(void)
{
    const csp_region_t* r = store_region();

    if (r == NULL)
	return -1;
    store_base = csp_region_offset(csp_device(), r);
    store_len  = csp_region_size(csp_device(), r);
    store_off  = 0;
    store_mode = 2;
    // ERASE THE WHOLE REGION HERE, once. Flash only goes 1 -> 0, so a save over
    // a previous one has to start from erased -- and doing it at open rather
    // than per write means one erase per /save, which is what the part's
    // endurance budget is written for.
    if (csp_flash_erase(r->first, r->last) < 0) {
	store_mode = 0;
	return -1;
    }
    return 0;
}

void csp_eeprom_close(void) { store_mode = 0; }

int csp_eeprom_read(void* buf, size_t len)
{
    if (store_mode != 1)
	return -1;
    if (store_off + len > store_len)
	return -1;
    if (csp_flash_read(store_base + store_off, buf, (uint32_t)len) < 0)
	return -1;
    store_off += (uint32_t)len;
    return 0;
}

int csp_eeprom_write(const void* buf, size_t len)
{
    if (store_mode != 2)
	return -1;
    // Refuse to run off the end rather than wrap: a program too big to persist
    // would otherwise half-save silently.
    if (store_off + len > store_len)
	return -1;
    if (csp_flash_write(store_base + store_off, buf, (uint32_t)len) < 0)
	return -1;
    store_off += (uint32_t)len;
    return 0;
}

#else

const char* csp_eeprom_name(void)   { static const char nm[] = "none"; return nm; }
uint32_t csp_eeprom_capacity(void)  { return 0; }
int  csp_eeprom_open_read(void)     { return -1; }
int  csp_eeprom_open_write(void)    { return -1; }
void csp_eeprom_close(void)         { }
int  csp_eeprom_read(void* b, size_t n)        { (void)b; (void)n; return -1; }
int  csp_eeprom_write(const void* b, size_t n) { (void)b; (void)n; return -1; }

#endif

// ============================================================
// main
// ============================================================

static void stm_setup(void)
{
    stm_tick_init();
    stm_uart_init();
    serial_output = 1;

    csp_board_init();

#if !defined(CSP_EXEC_ONLY)
    // The clock is reported from what sysinit COMPUTED, and the PLL is checked
    // against what it actually selected -- so a crystal that never started
    // shows up here as a number instead of as a mystery further along.
    csp_print_lit("boot: clk "); csp_print_uint(csp_stm_hclk);
    if ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
	csp_print_lit(" (PLL DID NOT LOCK -- running on HSI)");
    csp_print_lit(", RAM "); csp_print_uint(csp_system_ram_capacity());
    csp_print_lit(", free ");  csp_print_uint(csp_system_ram_avail());
    csp_print_lit(", struct "); csp_print_uint((uint32_t)sizeof(csp_rt_t));
    csp_println();
#endif

    if (csp_rt_init(&state, REACTIVE_DEFAULT, CSP_CSTATE) < 0) {
	csp_print_line("FATAL: csp_rt_init failed (out of memory)");
	return;
    }

    // WHICH image, before one is loaded. sys.Boot lives in the settings store,
    // so the store is read on its own first.
#if !defined(CSP_NO_EEPROM)
    csp_eeprom_peek(&state);
    csp_boot_pick(&state);
#endif
    csp_load_rom(&state);

#if !defined(CSP_NO_EEPROM)
    if (csp_eeprom_load(&state) == 0) {
#if !defined(CSP_EXEC_ONLY)
	csp_print_line("Loaded from store");
#endif
    }
    else {
	// "no saved state" is the normal case at boot, not an error to carry
	// forward into the first cycle.
	csp_clr_error(&state);
#if !defined(CSP_EXEC_ONLY)
	csp_print_line("No saved state, running ROM");
#endif
    }
#endif

    // Lay out the whole program: reactive graph + leaf/device setup. MUST be
    // csp_rebuild and not a bare start -- rebuild resets the middle bump
    // allocator every derived table is carved from, and without it mid_end
    // stays 0, every table allocation fails, and the first cycle faults on null
    // view/heap pointers.
    if (csp_rebuild(&state) < 0)
	csp_print_line("setup failed: out of memory");

    csp_setup(&state);
}

static void stm_loop(void)
{
    index_t x;

    if (state.mem == NULL || state.mem_limit == 0)
	return;

#if !defined(CSP_EXEC_ONLY)
    if (!state.line.ready)
	csp_line_prompt(&state.line);
    while (stm_uart_available() && csp_line_space(&state.line) &&
	   csp_con_space())
	csp_con_input(&state, (char)stm_uart_read());
    if (state.line.ready) {
	csp_process_line(&state, state.line.buf);
	csp_line_done(&state.line);
    }
#endif

    if (!state.started)
	return;

    if (first_cycle) {
	state.cycle = 1;
	first_cycle = 0;
    }
    else if (!state.paused)
	state.cycle++;

    // The routes still run while paused -- they move bytes between transports
    // and touch nothing the pause protects. /upgrade pauses the node for the
    // flash write, so without this a node being upgraded OVER a route stops
    // reading the link the image is arriving on.
    if (state.paused) {
	csp_route_run(&state);
	return;
    }

    csp_input(&state);
    x = state.live ? BAD_INDEX : csp_cycle(&state);
    (void)x;
    csp_commit(&state);
    csp_output(&state);

    // A running timer sets wait_ms, but that must NOT gate the whole loop:
    // continuous inputs have to keep sampling at a steady rate. Never sleep
    // longer than SAMPLE_MS in one pass.
    {
	uint32_t remaining = (state.es.wait_ms != NOTIMEOUT)
			   ? state.es.wait_ms : SAMPLE_MS;
	if (remaining > SAMPLE_MS)
	    remaining = SAMPLE_MS;
	while ((remaining > 0) && !state.line.ready) {
	    uint32_t chunk = (remaining < 10) ? remaining : 10;
	    csp_delay_ms(chunk);
	    remaining -= chunk;
#if !defined(CSP_EXEC_ONLY)
	    while (stm_uart_available() && csp_line_space(&state.line))
		csp_con_input(&state, (char)stm_uart_read());
#endif
	}
    }
}

int main(void)
{
    stm_setup();
    for (;;)
	stm_loop();
    return 0;
}
